Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 32, 32, 3)         0         
_________________________________________________________________
C1 (Conv2D)                  (None, 24, 24, 50)        12200     
_________________________________________________________________
S1 (MaxPooling2D)            (None, 12, 12, 50)        0         
_________________________________________________________________
C2 (Conv2D)                  (None, 8, 8, 60)          75060     
_________________________________________________________________
S2 (MaxPooling2D)            (None, 4, 4, 60)          0         
_________________________________________________________________
flatten (Flatten)            (None, 960)               0         
_________________________________________________________________
F3 (Dense)                   (None, 300)               288300    
_________________________________________________________________
F4 (Dense)                   (None, 10)                3010      
=================================================================
Total params: 378,570
Trainable params: 378,570
Non-trainable params: 0
_________________________________________________________________